# Урок 2. Некоторые встроенные типы и операции с ними
## Задание 1
#Выяснить тип результата выражений:


#15 * 3      #<class 'int'>
#15 / 3      #<class 'float'>
#15 // 2     #<class 'int'>
#15 ** 2     #<class 'int'>


print(type(15 * 3))
print(type(15 / 3))
print(type(15 // 2))
print(type(15 ** 2))


#end